app/controllers/todos_controller.rb

INSERT INTO "todos" ("name", "description") VALUES (?, ?)  [["name", "dfrgh"], ["description", "gsethuyyju"]]
---
    def create
     @todo=Todo.new(todo_params)
     if @todo.save

UPDATE "todos" SET "name" = ? WHERE "todos"."id" = ?  [["name", "dfrghczbvdfh"], ["id", 22]]
---
     def update

    if @todo.update(todo_params)