app/controllers/todos_controller.rb

    def show
        @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

     def edit
     @todo=Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

     def update
    @todo=Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]